ГТС/УТГТС/InformationRegisters/РаспределениеЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РаспределениеЗапасов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОбеспечениюБезРезерва</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резервировать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбеспечивать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарезервировано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбеспечено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Свободно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Излишек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладеПоВсемЗаказамСводно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РезервироватьПоМереПоступленияИтогНаДату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбеспеченоКОбеспечению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РаспределениеЗапасовСостояния</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаОтгрузку</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЖелаемаяДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПоступление</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемоеПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПоступления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗаписиРаспределенияЗапасов</Name>
					<Comment>Дополнительный разделитель для ускорения записи наборов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/ЗапасыИПотребности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗапасыИПотребности</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВНаличии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поступит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервироватьПоМереПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтложитьРезервирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОбеспечению</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеОбеспечивать</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрытьГрафикОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгружаемыйЗаказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузка</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейЗапасыИПотребности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОжидаемаяОтгрузкаИлиПоступление</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/РаспределениеЗапасовСостояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РаспределениеЗапасовСостояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаемаяОтгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстатокНаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаемоеПоступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеНеПодтвержденное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРезерве</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарезервированПриПоступлении</Name>
					<Comment>В резерве (зарезервирован при поступлении)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОтложитьОбеспечение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспеченНаСкладе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспеченКДате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетсяПоНеподтвержденномуЗаказу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обеспечить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОбеспечивать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/HTTPServices/ЛКДОстатки/Ext/Module.bsl
Функция CustomerInfoPostCustomerInfo(Запрос) 
	МассивОшибок = Новый Массив;  
	МассивОтвета = Новый Массив;
	Ошибка = Ложь;              
	ЗаписьЖурналаРегистрации("ПроверкаЛКД", УровеньЖурналаРегистрации.Примечание, , , "Зашел");
	Попытка	
		Сообщение = Запрос.ПолучитьТелоКакСтроку("UTF-8");
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Сообщение);
		ДанныеКлиентов = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		КодКлиента = ""; 
		Для Каждого ДанныеКлиента из ДанныеКлиентов Цикл 
			Если ДанныеКлиента.Свойство("id", КодКлиента) Тогда
				Попытка
					Клиент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(КодКлиента)); /// 
					Если ДанныеКлиента.Свойство("LKDCreated")  и  не  Клиент.СозданЛКПНаСайте = Булево(ДанныеКлиента.LKDCreated) Тогда  
						Клиент = Клиент.ПолучитьОбъект(); 
						Клиент.СозданЛКПНаСайте = Булево(ДанныеКлиента.LKDCreated); 
						Клиент.Записать();
					КонецЕсли; 
					МассивОтвета.Добавить("Обработаны реквизиты контрагента: " + КодКлиента) 
				Исключение
					//Клиент = Справочники.Контрагенты.СоздатьЭлемент(); 
					//Если ДанныеКлиента.Свойство("НаименованиеПолное") Тогда
					//	Клиент.НаименованиеПолное = ДанныеКлиента.НаименованиеПолное;
					//Иначе 
					//	Клиент.НаименованиеПолное = ДанныеКлиента.id;
					//КонецЕсли;
					//Если ДанныеКлиента.Свойство("ЛКД") Тогда
					//	Клиент.ЛКД = ДанныеКлиента.ЛКД; 
					//КонецЕсли;
					//Клиент.Записать();  
					МассивОтвета.Добавить("В базе не найден контрагент " + КодКлиента) 
				КонецПопытки;	
			Иначе 
				Ошибка = Истина;
				МассивОшибок.Добавить("Нет свойства id контрагента")
			КонецЕсли;
		КонецЦикла;
	Исключение
		Ошибка = Истина;
	КонецПопытки;
	Если Ошибка Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Структура = Новый Структура;
		Структура.Вставить("Успех",МассивОтвета);
		Структура.Вставить("Errors",МассивОшибок );
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Структура); 
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8"); ///???
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	Иначе 
		Ответ = Новый HTTPСервисОтвет(200); 
		Структура = Новый Структура;
		Структура.Вставить("Успех",МассивОтвета) ; 
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Структура); 
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8"); ///???
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	КонецЕсли;			
КонецФункции

Функция WarehouseBalanceInfogetWarehouseBalanceInfo(Запрос) 
	Сообщение = Запрос.ПолучитьТелоКакСтроку("UTF-8");  
	ОтветНомен = Новый HTTPСервисОтвет(200);
	ОтветОшибкаНом = Новый HTTPСервисОтвет(404);  
	ОтветОшибка = Новый HTTPСервисОтвет(400);  
	ОшибкаНоменклатуры = Ложь;
	ОшибкаОбработки = Ложь; 
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Сообщение);
		ДанныеКлиентов = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		Ответ = Новый Структура;
		МассивОтвета = Новый Массив; 
		МассивОшибок = Новый Массив; 
		КодКлиента = ""; 
		Для Каждого ДанныеКлиента из ДанныеКлиентов.ИдентификаторКонтрагента Цикл 
			НоменклатураСайта = Новый Массив;
			ТаблицаНоменклатуры = Новый ТаблицаЗначений; 
			ТаблицаНоменклатуры.Колонки.Добавить("Контрагент");
			ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТаблицаНоменклатуры.Колонки.Добавить("id");
			ТаблицаНоменклатуры.Колонки.Добавить("code");
			ОстаткиТовара = Новый Массив;
			СтруктураОтвета  = Новый Структура;
			Если ДанныеКлиента.Свойство("id", КодКлиента) Тогда
				//Клиент = Справочники.Контрагенты.ПолучитьСсылку(КодКлиента);
				СтруктураОтвета.Вставить("id", ДанныеКлиента.id); 
			КонецЕсли;
			Если ДанныеКлиента.Свойство("Номенклатура", НоменклатураСайта) Тогда
				Для каждого Товар Из НоменклатураСайта Цикл  
					Номенклатура  = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Товар.code));
					Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда 
						МассивОшибок.Добавить("Не найдена номенклатура  " +  Товар.id );
						ОшибкаНоменклатуры = Истина;
					Иначе 
						НовСтрока = ТаблицаНоменклатуры.Добавить();	
						НовСтрока.Номенклатура = Номенклатура;
						НовСтрока.id = Товар.id;
						НовСтрока.code = Товар.code;
						НовСтрока.Контрагент = ДанныеКлиента.id; 
					КонецЕсли; 
				КонецЦикла;
			КонецЕсли; 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВремНоменклатураОтбор
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка В(&СписокТоваров)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
			|	ВариантыКомплектацииНоменклатуры.Владелец КАК Комплект,
			|	ВЫБОР
			|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|		ИНАЧЕ ХарактеристикиНоменклатуры.Ссылка
			|	КОНЕЦ КАК Характеристика,
			|	ВЫБОР
			|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ХарактеристикиНоменклатуры.Б_Идентификатор = """"
			|					ТОГДА ХарактеристикиНоменклатуры.Ссылка
			|				ИНАЧЕ ХарактеристикиНоменклатуры.Б_Идентификатор
			|			КОНЕЦ
			|	КОНЕЦ КАК ИдентификаторХарактеристики,
			|	ВЫБОР
			|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
			|			ТОГДА НЕОПРЕДЕЛЕНО
			|		ИНАЧЕ ХарактеристикиНоменклатуры.ВерсияДанных
			|	КОНЕЦ КАК ВерсияДанныхХарактеристики,
			|	ХарактеристикиНоменклатуры.Наименование КАК НаименованиеХарактеристики,
			|	ВЫБОР
			|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
			|			ТОГДА ЛОЖЬ
			|		ИНАЧЕ ХарактеристикиНоменклатуры.ПометкаУдаления
			|	КОНЕЦ КАК ПометкаУдаленияХарактеристики,
			|	ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования КАК ХарактеристикаНоменклатурыДляЦенообразования
			|ПОМЕСТИТЬ ВремНоменклатураКомплектующиеОтбор
			|ИЗ
			|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
			|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			|		ПО ВариантыКомплектацииНоменклатурыТовары.Характеристика = ХарактеристикиНоменклатуры.Ссылка
			|ГДЕ
			|	ВариантыКомплектацииНоменклатуры.Владелец В(&СписокТоваров)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Комплект,
			|	Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремНоменклатураОтбор.Ссылка КАК Номенклатура
			|ПОМЕСТИТЬ ВремНоменклатураОтбораИКомплектующих
			|ИЗ
			|	ВремНоменклатураОтбор КАК ВремНоменклатураОтбор
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ВремНоменклатураКомплектующие.Номенклатура
			|ИЗ
			|	ВремНоменклатураКомплектующиеОтбор КАК ВремНоменклатураКомплектующие
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Склады.Ссылка КАК Склад,
			|	ВЫБОР
			|		КОГДА Склады.Б_Идентификатор = """"
			|			ТОГДА Склады.Ссылка
			|		ИНАЧЕ Склады.Б_Идентификатор
			|	КОНЕЦ КАК Идентификатор
			|ПОМЕСТИТЬ ВремСклады
			|ИЗ
			|	Справочник.Склады КАК Склады
			|ГДЕ
			|	НЕ Склады.ЭтоГруппа
			|	И Склады.ИспользоватьДляСайта = ИСТИНА
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Склад
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
			|	РаспределениеЗапасов.Характеристика КАК Характеристика,
			|	СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличииОстаток,
			|	СУММА(РаспределениеЗапасов.Свободно) КАК СвободноОстаток,
			|	РаспределениеЗапасов.Склад КАК Склад
			|ПОМЕСТИТЬ ВремДанныеПоОстаткам
			|ИЗ
			|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатураОтбораИКомплектующих КАК ВремНоменклатураОтбораИКомплектующих
			|		ПО РаспределениеЗапасов.Номенклатура = ВремНоменклатураОтбораИКомплектующих.Номенклатура
			|ГДЕ
			|	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
			|	И РаспределениеЗапасов.Склад В
			|			(ВЫБРАТЬ
			|				ВремСклады.Склад
			|			ИЗ
			|				ВремСклады)
			|
			|СГРУППИРОВАТЬ ПО
			|	РаспределениеЗапасов.Номенклатура,
			|	РаспределениеЗапасов.Характеристика,
			|	РаспределениеЗапасов.Склад
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремДанныеПоОстаткам.Номенклатура КАК Номенклатура,
			|	ВремДанныеПоОстаткам.Характеристика КАК Характеристика,
			|	ВремДанныеПоОстаткам.Склад КАК Склад,
			|	ВремДанныеПоОстаткам.ВНаличииОстаток КАК ВНаличииОстаток,
			|	ВремДанныеПоОстаткам.СвободноОстаток КАК СвободноОстаток,
			|	ВЫБОР
			|		КОГДА НоменклатураСсылка.Б_Идентификатор = """"""""
			|			ТОГДА НоменклатураСсылка.Ссылка
			|		ИНАЧЕ НоменклатураСсылка.Б_Идентификатор
			|	КОНЕЦ КАК ИдентификаторНоменклатуры,
			|	ВЫБОР
			|		КОГДА СкладыСсылка.Б_Идентификатор = """"""""
			|			ТОГДА СкладыСсылка.Ссылка
			|		ИНАЧЕ СкладыСсылка.Б_Идентификатор
			|	КОНЕЦ КАК ИдентификаторСклада,
			|	ВЫБОР
			|		КОГДА ХарактеристикиНоменклатурыСсылка.Б_Идентификатор = """"""""
			|			ТОГДА ХарактеристикиНоменклатурыСсылка.Ссылка
			|		ИНАЧЕ ХарактеристикиНоменклатурыСсылка.Б_Идентификатор
			|	КОНЕЦ КАК ИдентификаторХарактеристики
			|ПОМЕСТИТЬ ВремОстаткиПоСкладам
			|ИЗ
			|	ВремДанныеПоОстаткам КАК ВремДанныеПоОстаткам
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСсылка
			|		ПО ВремДанныеПоОстаткам.Номенклатура = НоменклатураСсылка.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатурыСсылка
			|		ПО ВремДанныеПоОстаткам.Характеристика = ХарактеристикиНоменклатурыСсылка.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыСсылка
			|		ПО ВремДанныеПоОстаткам.Склад = СкладыСсылка.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремСклады.Склад КАК Склад,
			|	ВремСклады.Идентификатор КАК Идентификатор
			|ИЗ
			|	ВремСклады КАК ВремСклады
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВремОстаткиПоСкладам.Номенклатура КАК Номенклатура,
			|	ВремОстаткиПоСкладам.Склад КАК Склад,
			|	СУММА(ВремОстаткиПоСкладам.ВНаличииОстаток) КАК ВНаличииОстаток,
			|	СУММА(ВремОстаткиПоСкладам.СвободноОстаток) КАК СвободноОстаток,
			|	ВремОстаткиПоСкладам.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
			|	ВремОстаткиПоСкладам.ИдентификаторСклада КАК ИдентификаторСклада
			|ИЗ
			|	ВремОстаткиПоСкладам КАК ВремОстаткиПоСкладам
			|
			|СГРУППИРОВАТЬ ПО
			|	ВремОстаткиПоСкладам.Номенклатура,
			|	ВремОстаткиПоСкладам.Склад,
			|	ВремОстаткиПоСкладам.ИдентификаторНоменклатуры,
			|	ВремОстаткиПоСкладам.ИдентификаторСклада";
			
			Запрос.УстановитьПараметр("СписокТоваров", ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
			
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			ТзнОстатков = РезультатЗапроса[7].Выгрузить();
			ТзнСкладов = РезультатЗапроса[6].Выгрузить();
			
			Для Каждого ТекНоменклатура Из ТаблицаНоменклатуры Цикл 
				СтруктураОст = Новый Структура; 
				СтруктураОст.Вставить("id" , ТекНоменклатура.id);
				СтруктураОст.Вставить("code" ,ТекНоменклатура.code);
				МассивСклады = Новый Массив;     
				Для Каждого ТекСклад Из ТзнСкладов Цикл 
					Структура = Новый Структура;
					Структура.Вставить( "id" , Строка(ТекСклад.Склад.УникальныйИдентификатор())); 
					
					Отбор = Новый Структура;
					Отбор.Вставить("Склад",ТекСклад.Склад);
					Отбор.Вставить("Номенклатура",ТекНоменклатура.Номенклатура);
					НайденнаяСтроки = ТзнОстатков.НайтиСтроки(Отбор); 
					
					
					Если не НайденнаяСтроки.Количество()>0 тогда
						//ГТС начало получаем возможные остатки наборов 
						Остаток = 0;
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
						|	ВариантыКомплектацииНоменклатурыТовары.Количество,
						|	ВариантыКомплектацииНоменклатуры.Владелец,
						|	ВариантыКомплектацииНоменклатуры.Основной
						|ИЗ
						|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
						|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
						|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
						|ГДЕ
						|	ВариантыКомплектацииНоменклатуры.Владелец = &ТекТовар
						|	И ВариантыКомплектацииНоменклатуры.Основной = &Основной";
						
						Запрос.УстановитьПараметр("ТекТовар", ТекНоменклатура.Номенклатура);
						Запрос.УстановитьПараметр("Основной", ИСТИНА);
						РезультатЗапроса = Запрос.Выполнить();
						
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						ТЗ = Новый ТаблицаЗначений;
						ТЗ.Колонки.Добавить("Количество");
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							КоличествоДоступ = 0;
							ЗапросОстатокРезервов = Новый Запрос;
							ЗапросОстатокРезервов.Текст =
							"ВЫБРАТЬ
							|	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток, 0)) КАК СвободныйОстаток,
							|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура
							|ИЗ
							|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Номенклатура = &Номенклатура)  КАК ЗапасыИПотребностиОстатки
							|ГДЕ
							|	ЗапасыИПотребностиОстатки.Склад.ИспользоватьДляСайта = ИСТИНА
							|	И ЗапасыИПотребностиОстатки.Склад = &Склад
							|
							|СГРУППИРОВАТЬ ПО
							|	ЗапасыИПотребностиОстатки.Номенклатура";
							ЗапросОстатокРезервов.УстановитьПараметр("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
							ЗапросОстатокРезервов.УстановитьПараметр("Склад", ТекСклад.Склад);
							
							ТЗ_ОстаткиРезервов = ЗапросОстатокРезервов.Выполнить().Выбрать();
							
							Пока ТЗ_ОстаткиРезервов.Следующий() Цикл
								Если ВыборкаДетальныеЗаписи.Количество> 0 тогда
									КоличествоДоступ  = ТЗ_ОстаткиРезервов.СвободныйОстаток/ВыборкаДетальныеЗаписи.Количество;
								Иначе
									КоличествоДоступ  = ТЗ_ОстаткиРезервов.СвободныйОстаток;
								КонецЕсли;
							КонецЦикла;
							НовоеЗначение = ТЗ.Добавить();
							НовоеЗначение.Количество = КоличествоДоступ;
						КонецЦикла;
						Тест = ТЗ.ВыгрузитьКолонку("Количество");
						ТЗ.Сортировать("Количество Возр");
						
						если ТЗ.Количество() > 0 тогда
							Остаток = окр(ТЗ[0].Количество, 0,0); 
						Иначе 
							Остаток = 0;
						конецесли;
					Иначе 
						НайденнаяСтрока = НайденнаяСтроки[0];
						Остаток	= НайденнаяСтрока.СвободноОстаток;
					КонецЕсли;	
					Структура.Вставить("count" , Остаток);   
					МассивСклады.Добавить(Структура);
				КонецЦикла;
				
				СтруктураОст.Вставить("count" ,МассивСклады);
				ОстаткиТовара.Добавить(СтруктураОст);
			КонецЦикла;  
			СтруктураОтвета.Вставить("Номенклатура", ОстаткиТовара);
			МассивОтвета.Добавить(СтруктураОтвета)/// 
		КонецЦикла;
	Исключение
		ОшибкаОбработки = Истина;
	КонецПопытки;
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	Ответ.Вставить("ИдентификаторКонтрагента",МассивОтвета );
	Ответ.Вставить("Errors",МассивОшибок );
	Если ОшибкаОбработки Тогда  
		ЗаписатьJSON(ЗаписьJSON, Ответ);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		ОтветОшибка.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8"); ///???
		ОтветОшибка.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Возврат ОтветОшибка;
	Иначе
		Если ОшибкаНоменклатуры Тогда
			ЗаписатьJSON(ЗаписьJSON, Ответ);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			ОтветОшибкаНом.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8"); ///???
			ОтветОшибкаНом.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			Возврат ОтветОшибкаНом;  
		Иначе	
			ЗаписатьJSON(ЗаписьJSON, Ответ);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			ОтветНомен.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8"); ///???
			ОтветНомен.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			Возврат ОтветНомен;  
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

//Функция WarehouseBalanceInfoPOSTReservOfGoods(Запрос)    
//	
//	//Сообщение = Запрос.ПолучитьТелоКакСтроку("UTF-8");  
//	//ОтветНомен = Новый HTTPСервисОтвет(200);
//	//ОтветОшибкаНом = Новый HTTPСервисОтвет(404);  
//	//ОтветОшибка = Новый HTTPСервисОтвет(400);  
//	//ОшибкаНоменклатуры = Ложь;
//	//ОшибкаОбработки = Ложь; 
//	//Попытка
//	//	ЧтениеJSON = Новый ЧтениеJSON;
//	//	ЧтениеJSON.УстановитьСтроку(Сообщение);
//	//	ДанныеКлиентов = ПрочитатьJSON(ЧтениеJSON);
//	//	ЧтениеJSON.Закрыть();
//	//	Ответ = Новый Структура;
//	//	МассивОтвета = Новый Массив; 
//	//	МассивОшибок = Новый Массив; 
//	//	КодКлиента = ""; 
//	//	Для Каждого ДанныеКлиента из ДанныеКлиентов.ИдентификаторКонтрагента Цикл 
//	//		НоменклатураСайта = Новый Массив;
//	//		ТаблицаНоменклатуры = Новый ТаблицаЗначений; 
//	//		ТаблицаНоменклатуры.Колонки.Добавить("Контрагент");
//	//		ТаблицаНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//	//		ТаблицаНоменклатуры.Колонки.Добавить("id");
//	//		ТаблицаНоменклатуры.Колонки.Добавить("code");  
//	//		ТаблицаНоменклатуры.Колонки.Добавить("Количество"); 
//	//		ТаблицаНоменклатуры.Колонки.Добавить("СкладID"); 
//	//		ТаблицаНоменклатуры.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады")); 
//	//		ТаблицаНоменклатуры.Колонки.Добавить("ХватаетОстатка"); 
//	//		
//	//		СтруктураОтвета  = Новый Структура; 
//	//		Если ДанныеКлиента.Свойство("id", КодКлиента) Тогда
//	//			Клиент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(КодКлиента));
//	//			СтруктураОтвета.Вставить("id", ДанныеКлиента.id); 
//	//		Иначе 
//	//			Клиент = Справочники.Контрагенты.ПустаяСсылка();
//	//		КонецЕсли; 
//	//		
//	//		Если ДанныеКлиента.Свойство("Номенклатура", НоменклатураСайта) Тогда
//	//			Для каждого Товар Из НоменклатураСайта Цикл  
//	//				Номенклатура  = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Товар.code));
//	//				Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда 
//	//					МассивОшибок.Добавить("Не найдена номенклатура  " +  Товар.id );
//	//					ОшибкаНоменклатуры = Истина;
//	//				Иначе 
//	//					НовСтрока = ТаблицаНоменклатуры.Добавить();	
//	//					НовСтрока.Номенклатура = Номенклатура;
//	//					НовСтрока.id = Товар.id;
//	//					НовСтрока.code = Товар.code;
//	//					НовСтрока.Контрагент = ДанныеКлиента.id; 
//	//					НовСтрока.Количество = Товар.count;  
//	//					Склад  = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(Товар.Склад)); 
//	//					НовСтрока.СкладID = Товар.Склад;  
//	//					НовСтрока.Склад = Склад; 
//	//				КонецЕсли; 
//	//			КонецЦикла;
//	//		КонецЕсли;
//	//		
//	//		//  проверка на нехватку товара на складах
//	//		
//	//		Запрос = Новый Запрос;
//	//		Запрос.Текст = 
//	//		"ВЫБРАТЬ
//	//		|	Номенклатура.Ссылка КАК Ссылка
//	//		|ПОМЕСТИТЬ ВремНоменклатураОтбор
//	//		|ИЗ
//	//		|	Справочник.Номенклатура КАК Номенклатура
//	//		|ГДЕ
//	//		|	Номенклатура.Ссылка В(&СписокТоваров)
//	//		|
//	//		|ИНДЕКСИРОВАТЬ ПО
//	//		|	Ссылка
//	//		|;
//	//		|
//	//		|////////////////////////////////////////////////////////////////////////////////
//	//		|ВЫБРАТЬ
//	//		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
//	//		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Комплект,
//	//		|	ВЫБОР
//	//		|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
//	//		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	//		|		ИНАЧЕ ХарактеристикиНоменклатуры.Ссылка
//	//		|	КОНЕЦ КАК Характеристика,
//	//		|	ВЫБОР
//	//		|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
//	//		|			ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
//	//		|		ИНАЧЕ ВЫБОР
//	//		|				КОГДА ХарактеристикиНоменклатуры.Б_Идентификатор = """"
//	//		|					ТОГДА ХарактеристикиНоменклатуры.Ссылка
//	//		|				ИНАЧЕ ХарактеристикиНоменклатуры.Б_Идентификатор
//	//		|			КОНЕЦ
//	//		|	КОНЕЦ КАК ИдентификаторХарактеристики,
//	//		|	ВЫБОР
//	//		|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
//	//		|			ТОГДА НЕОПРЕДЕЛЕНО
//	//		|		ИНАЧЕ ХарактеристикиНоменклатуры.ВерсияДанных
//	//		|	КОНЕЦ КАК ВерсияДанныхХарактеристики,
//	//		|	ХарактеристикиНоменклатуры.Наименование КАК НаименованиеХарактеристики,
//	//		|	ВЫБОР
//	//		|		КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
//	//		|			ТОГДА ЛОЖЬ
//	//		|		ИНАЧЕ ХарактеристикиНоменклатуры.ПометкаУдаления
//	//		|	КОНЕЦ КАК ПометкаУдаленияХарактеристики,
//	//		|	ХарактеристикиНоменклатуры.ХарактеристикаНоменклатурыДляЦенообразования КАК ХарактеристикаНоменклатурыДляЦенообразования
//	//		|ПОМЕСТИТЬ ВремНоменклатураКомплектующиеОтбор
//	//		|ИЗ
//	//		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
//	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
//	//		|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
//	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
//	//		|		ПО ВариантыКомплектацииНоменклатурыТовары.Характеристика = ХарактеристикиНоменклатуры.Ссылка
//	//		|ГДЕ
//	//		|	ВариантыКомплектацииНоменклатуры.Владелец В(&СписокТоваров)
//	//		|
//	//		|ИНДЕКСИРОВАТЬ ПО
//	//		|	Комплект,
//	//		|	Номенклатура
//	//		|;
//	//		|
//	//		|////////////////////////////////////////////////////////////////////////////////
//	//		|ВЫБРАТЬ
//	//		|	ВремНоменклатураОтбор.Ссылка КАК Номенклатура
//	//		|ПОМЕСТИТЬ ВремНоменклатураОтбораИКомплектующих
//	//		|ИЗ
//	//		|	ВремНоменклатураОтбор КАК ВремНоменклатураОтбор
//	//		|
//	//		|ОБЪЕДИНИТЬ
//	//		|
//	//		|ВЫБРАТЬ
//	//		|	ВремНоменклатураКомплектующие.Номенклатура
//	//		|ИЗ
//	//		|	ВремНоменклатураКомплектующиеОтбор КАК ВремНоменклатураКомплектующие
//	//		|
//	//		|ИНДЕКСИРОВАТЬ ПО
//	//		|	Номенклатура
//	//		|;
//	//		|
//	//		|////////////////////////////////////////////////////////////////////////////////
//	//		|ВЫБРАТЬ
//	//		|	Склады.Ссылка КАК Склад,
//	//		|	ВЫБОР
//	//		|		КОГДА Склады.Б_Идентификатор = """"
//	//		|			ТОГДА Склады.Ссылка
//	//		|		ИНАЧЕ Склады.Б_Идентификатор
//	//		|	КОНЕЦ КАК Идентификатор
//	//		|ПОМЕСТИТЬ ВремСклады
//	//		|ИЗ
//	//		|	Справочник.Склады КАК Склады
//	//		|ГДЕ
//	//		|	НЕ Склады.ЭтоГруппа
//	//		|	И Склады.ИспользоватьДляСайта = ИСТИНА
//	//		|	И Склады.Ссылка В(&Склады)
//	//		|
//	//		|ИНДЕКСИРОВАТЬ ПО
//	//		|	Склад
//	//		|;
//	//		|
//	//		|////////////////////////////////////////////////////////////////////////////////
//	//		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
//	//		|	РаспределениеЗапасов.Номенклатура КАК Номенклатура,
//	//		|	РаспределениеЗапасов.Характеристика КАК Характеристика,
//	//		|	СУММА(РаспределениеЗапасов.ВНаличии) КАК ВНаличииОстаток,
//	//		|	СУММА(РаспределениеЗапасов.Свободно) КАК СвободноОстаток,
//	//		|	РаспределениеЗапасов.Склад КАК Склад
//	//		|ПОМЕСТИТЬ ВремДанныеПоОстаткам
//	//		|ИЗ
//	//		|	РегистрСведений.РаспределениеЗапасов КАК РаспределениеЗапасов
//	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВремНоменклатураОтбораИКомплектующих КАК ВремНоменклатураОтбораИКомплектующих
//	//		|		ПО РаспределениеЗапасов.Номенклатура = ВремНоменклатураОтбораИКомплектующих.Номенклатура
//	//		|ГДЕ
//	//		|	РаспределениеЗапасов.Состояние = ЗНАЧЕНИЕ(Перечисление.РаспределениеЗапасовСостояния.ОстатокНаСкладе)
//	//		|	И РаспределениеЗапасов.Склад В
//	//		|			(ВЫБРАТЬ
//	//		|				ВремСклады.Склад
//	//		|			ИЗ
//	//		|				ВремСклады)
//	//		|
//	//		|СГРУППИРОВАТЬ ПО
//	//		|	РаспределениеЗапасов.Номенклатура,
//	//		|	РаспределениеЗапасов.Характеристика,
//	//		|	РаспределениеЗапасов.Склад
//	//		|;
//	//		|
//	//		|////////////////////////////////////////////////////////////////////////////////
//	//		|ВЫБРАТЬ
//	//		|	ВремДанныеПоОстаткам.Номенклатура КАК Номенклатура,
//	//		|	ВремДанныеПоОстаткам.Характеристика КАК Характеристика,
//	//		|	ВремДанныеПоОстаткам.Склад КАК Склад,
//	//		|	ВремДанныеПоОстаткам.ВНаличииОстаток КАК ВНаличииОстаток,
//	//		|	ВремДанныеПоОстаткам.СвободноОстаток КАК СвободноОстаток,
//	//		|	ВЫБОР
//	//		|		КОГДА НоменклатураСсылка.Б_Идентификатор = """"""""
//	//		|			ТОГДА НоменклатураСсылка.Ссылка
//	//		|		ИНАЧЕ НоменклатураСсылка.Б_Идентификатор
//	//		|	КОНЕЦ КАК ИдентификаторНоменклатуры,
//	//		|	ВЫБОР
//	//		|		КОГДА СкладыСсылка.Б_Идентификатор = """"""""
//	//		|			ТОГДА СкладыСсылка.Ссылка
//	//		|		ИНАЧЕ СкладыСсылка.Б_Идентификатор
//	//		|	КОНЕЦ КАК ИдентификаторСклада,
//	//		|	ВЫБОР
//	//		|		КОГДА ХарактеристикиНоменклатурыСсылка.Б_Идентификатор = """"""""
//	//		|			ТОГДА ХарактеристикиНоменклатурыСсылка.Ссылка
//	//		|		ИНАЧЕ ХарактеристикиНоменклатурыСсылка.Б_Идентификатор
//	//		|	КОНЕЦ КАК ИдентификаторХарактеристики
//	//		|ПОМЕСТИТЬ ВремОстаткиПоСкладам
//	//		|ИЗ
//	//		|	ВремДанныеПоОстаткам КАК ВремДанныеПоОстаткам
//	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСсылка
//	//		|		ПО ВремДанныеПоОстаткам.Номенклатура = НоменклатураСсылка.Ссылка
//	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатурыСсылка
//	//		|		ПО ВремДанныеПоОстаткам.Характеристика = ХарактеристикиНоменклатурыСсылка.Ссылка
//	//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СкладыСсылка
//	//		|		ПО ВремДанныеПоОстаткам.Склад = СкладыСсылка.Ссылка
//	//		|;
//	//		|
//	//		|////////////////////////////////////////////////////////////////////////////////
//	//		|ВЫБРАТЬ
//	//		|	ВремСклады.Склад КАК Склад,
//	//		|	ВремСклады.Идентификатор КАК Идентификатор
//	//		|ИЗ
//	//		|	ВремСклады КАК ВремСклады
//	//		|;
//	//		|
//	//		|////////////////////////////////////////////////////////////////////////////////
//	//		|ВЫБРАТЬ
//	//		|	ВремОстаткиПоСкладам.Номенклатура КАК Номенклатура,
//	//		|	ВремОстаткиПоСкладам.Склад КАК Склад,
//	//		|	СУММА(ВремОстаткиПоСкладам.ВНаличииОстаток) КАК ВНаличииОстаток,
//	//		|	СУММА(ВремОстаткиПоСкладам.СвободноОстаток) КАК СвободноОстаток,
//	//		|	ВремОстаткиПоСкладам.ИдентификаторНоменклатуры КАК ИдентификаторНоменклатуры,
//	//		|	ВремОстаткиПоСкладам.ИдентификаторСклада КАК ИдентификаторСклада
//	//		|ИЗ
//	//		|	ВремОстаткиПоСкладам КАК ВремОстаткиПоСкладам
//	//		|
//	//		|СГРУППИРОВАТЬ ПО
//	//		|	ВремОстаткиПоСкладам.Номенклатура,
//	//		|	ВремОстаткиПоСкладам.Склад,
//	//		|	ВремОстаткиПоСкладам.ИдентификаторНоменклатуры,
//	//		|	ВремОстаткиПоСкладам.ИдентификаторСклада";     
//	//		
//	//		
//	//		//??
//	//		Запрос.УстановитьПараметр("СписокТоваров", ТаблицаНоменклатуры.ВыгрузитьКолонку("Номенклатура"));
//	//		Запрос.УстановитьПараметр("Склады", ТаблицаНоменклатуры.ВыгрузитьКолонку("Склад"));
//	//		
//	//		РезультатЗапроса = Запрос.ВыполнитьПакет();
//	//		
//	//		ТзнОстатков = РезультатЗапроса[7].Выгрузить();
//	//		//ТзнСкладов = РезультатЗапроса[6].Выгрузить(); 
//	//		
//	//		
//	//		ТаблицаСкладов = ТаблицаНоменклатуры.СкопироватьКолонки("Склад");  
//	//		ТаблицаСкладов.Свернуть("Склад");
//	//		Для каждого Склад из ТаблицаСкладов Цикл
//	//			
//	//			ТаблицаДляЗагрузкиВЗК = Новый ТаблицаЗначений;
//	//			
//	//			ТаблицаДляЗагрузкиВЗК.Колонки.Добавить("Контрагент");
//	//			ТаблицаДляЗагрузкиВЗК.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//	//			//ТаблицаДляЗагрузкиВЗК.Колонки.Добавить("id");
//	//			//ТаблицаДляЗагрузкиВЗК.Колонки.Добавить("code");  
//	//			ТаблицаДляЗагрузкиВЗК.Колонки.Добавить("Количество"); 
//	//			ТаблицаДляЗагрузкиВЗК.Колонки.Добавить("СкладID"); 
//	//			ТаблицаДляЗагрузкиВЗК.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады")); 
//	//			
//	//			ОтборСКЛ = Новый Структура();
//	//			ОтборСКЛ.Вставить("Склад",Склад);
//	//			СтрокиПоСкладу = ТаблицаНоменклатуры.НайтиСтроки(ОтборСКЛ);  
//	//			Для Каждого Стр из СтрокиПоСкладу  Цикл 
//	//				
//	//				Отбор = Новый Структура;
//	//				Отбор.Вставить("Склад",Стр.Склад);
//	//				Отбор.Вставить("Номенклатура",Стр.Номенклатура);
//	//				НайденнаяСтроки = ТзнОстатков.НайтиСтроки(Отбор);
//	//				
//	//				ЗарезервирКолич = 0;
//	//				УжеЗарезервировано = ТаблицаДляЗагрузкиВЗК.НайтиСтроки(Отбор);   
//	//				Если УжеЗарезервировано.Количество()>0 тогда    
//	//					ЗарезервирКолич = УжеЗарезервировано[0].Количество;
//	//				КонецЕсли; 	
//	//				
//	//				
//	//				Остаток = 0;
//	//				Если НайденнаяСтроки.Количество()>0 тогда    
//	//					НайденнаяСтрока = НайденнаяСтроки[0];
//	//					Остаток	= НайденнаяСтрока.СвободноОстаток - ЗарезервирКолич;
//	//				КонецЕсли; 	
//	//				Если Остаток > Стр.Количество Тогда  
//	//					Новаязапись = ТаблицаДляЗагрузкиВЗК.Добавить();
//	//					Новаязапись.Номенклатура =  Стр.Номенклатура;
//	//					Новаязапись.Контрагент =    Стр.Контрагент;
//	//					//Новаязапись.id = Стр.id;   
//	//					//Новаязапись.code =  Стр.code;
//	//					Новаязапись.Количество =    Стр.Количество;
//	//					Новаязапись.Контрагент =    Стр.Контрагент;
//	//					Новаязапись.СкладID = Стр.СкладID;   
//	//					Новаязапись.Склад =  Стр.Склад;
//	//				Иначе
//	//					НеХватает = Стр.Количество-Остаток; 
//	//					Новаязапись = ТаблицаДляЗагрузкиВЗК.Добавить();
//	//					Новаязапись.Номенклатура =  Стр.Номенклатура;
//	//					Новаязапись.Контрагент =    Стр.Контрагент;
//	//					//Новаязапись.id = Стр.id ;  
//	//					//Новаязапись.code =  Стр.code;
//	//					Новаязапись.Количество =    Остаток;
//	//					Новаязапись.Контрагент =    Стр.Контрагент;
//	//					Новаязапись.СкладID = Стр.СкладID;   
//	//					Новаязапись.Склад =  Стр.Склад;
//	//					
//	//					// получаем возможные остатки наборов 
//	//					ОстатокСборки = 0;
//	//					
//	//					Запрос = Новый Запрос;
//	//					Запрос.Текст = 
//	//					"ВЫБРАТЬ
//	//					|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
//	//					|	ВариантыКомплектацииНоменклатурыТовары.Количество,
//	//					|	ВариантыКомплектацииНоменклатуры.Владелец,
//	//					|	ВариантыКомплектацииНоменклатуры.Основной
//	//					|ИЗ
//	//					|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
//	//					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
//	//					|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
//	//					|ГДЕ
//	//					|	ВариантыКомплектацииНоменклатуры.Владелец = &ТекТовар
//	//					|	И ВариантыКомплектацииНоменклатуры.Основной = &Основной";
//	//					
//	//					Запрос.УстановитьПараметр("ТекТовар", Стр.Номенклатура);
//	//					Запрос.УстановитьПараметр("Основной", ИСТИНА);
//	//					РезультатЗапроса = Запрос.Выполнить();
//	//					
//	//					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//	//					ТЗ = Новый ТаблицаЗначений;
//	//					ТЗ.Колонки.Добавить("Количество");
//	//					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//	//						КоличествоДоступ = 0;
//	//						ЗапросОстатокРезервов = Новый Запрос;
//	//						ЗапросОстатокРезервов.Текст =
//	//						"ВЫБРАТЬ
//	//						|	СУММА(ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток, 0)) КАК СвободныйОстаток,
//	//						|	ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура
//	//						|ИЗ
//	//						|	РегистрНакопления.ЗапасыИПотребности.Остатки(, Номенклатура = &Номенклатура)  КАК ЗапасыИПотребностиОстатки
//	//						|ГДЕ
//	//						|	ЗапасыИПотребностиОстатки.Склад.ИспользоватьДляСайта = ИСТИНА
//	//						|	И ЗапасыИПотребностиОстатки.Склад = &Склад
//	//						|
//	//						|СГРУППИРОВАТЬ ПО
//	//						|	ЗапасыИПотребностиОстатки.Номенклатура";
//	//						ЗапросОстатокРезервов.УстановитьПараметр("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
//	//						ЗапросОстатокРезервов.УстановитьПараметр("Склад", Стр.Склад);
//	//						
//	//						ТЗ_ОстаткиРезервов = ЗапросОстатокРезервов.Выполнить().Выбрать();
//	//						
//	//						Пока ТЗ_ОстаткиРезервов.Следующий() Цикл 
//	//							
//	//				ЗарезервирКоличКомпл = 0;
//	//				ОтборКомпл = Новый Структура;
//	//				ОтборКомпл.Вставить("Номенклатура",ТЗ_ОстаткиРезервов.Номенклатура);
//	//				УжеЗарезервированоКомпл = ТаблицаДляЗагрузкиВЗК.НайтиСтроки(ОтборКомпл);   
//	//				Если УжеЗарезервированоКомпл.Количество()>0 тогда    
//	//					ЗарезервирКоличКомпл = УжеЗарезервированоКомпл[0].Количество;
//	//				КонецЕсли; 	
//	//				
//	//							
//	//							Если ВыборкаДетальныеЗаписи.Количество> 0 тогда
//	//								КоличествоДоступ  = (ТЗ_ОстаткиРезервов.СвободныйОстаток-ЗарезервирКоличКомпл)/ВыборкаДетальныеЗаписи.Количество;
//	//							Иначе
//	//								КоличествоДоступ  = ТЗ_ОстаткиРезервов.СвободныйОстаток-ЗарезервирКоличКомпл;
//	//							КонецЕсли;
//	//						КонецЦикла;
//	//						НовоеЗначение = ТЗ.Добавить();
//	//						НовоеЗначение.Количество = КоличествоДоступ;
//	//					КонецЦикла;
//	//					Тест = ТЗ.ВыгрузитьКолонку("Количество");
//	//					ТЗ.Сортировать("Количество Возр");
//	//					
//	//					если ТЗ.Количество() > 0 тогда
//	//						ОстатокСборки = окр(ТЗ[0].Количество, 0,0); 
//	//					Иначе 
//	//						ОстатокСборки = 0;
//	//					конецесли; 
//	//					Если ОстатокСборки > НеХватает Тогда
//	//						
//	//						СписокКомпл = РезультатЗапроса.Выгрузить();
//	//						
//	//						Для Каждого Компл из СписокКомпл Цикл 
//	//							Новаязапись1 = ТаблицаДляЗагрузкиВЗК.Добавить();
//	//							Новаязапись1.Номенклатура =  Компл.Номенклатура;
//	//							Новаязапись1.Контрагент =    Стр.Контрагент;
//	//							//Новаязапись.id = Стр.id   
//	//							//Новаязапись.code =  Стр.code;
//	//							Новаязапись1.Количество =    НеХватает;
//	//							Новаязапись1.Контрагент =    Стр.Контрагент;
//	//							Новаязапись1.СкладID = Стр.СкладID;   
//	//							Новаязапись1.Склад =  Стр.Склад;
//	//						КонеЦЦикла;
//	//						
//	//					Иначе 
//	//						СовсемНеХватило = НеХватает-ОстатокСборки;
//	//						СписокКомпл = РезультатЗапроса.Выгрузить();
//	//						Для Каждого Компл из СписокКомпл Цикл 
//	//							Новаязапись2 = ТаблицаДляЗагрузкиВЗК.Добавить();
//	//							Новаязапись2.Номенклатура =  Компл.Номенклатура;
//	//							Новаязапись2.Контрагент =    Стр.Контрагент;
//	//							//Новаязапись.id = Стр.id   
//	//							//Новаязапись.code =  Стр.code;
//	//							Новаязапись2.Количество =    ОстатокСборки;
//	//							Новаязапись2.Контрагент =    Стр.Контрагент;
//	//							Новаязапись2.СкладID = Стр.СкладID;   
//	//							Новаязапись2.Склад =  Стр.Склад; 
//	//						КонеЦЦикла; 
//	//						МассивОшибок.Добавить("Для резервирования товара "+ Стр.id + " на складе " +  Стр.СкладID +" не хватает свободного остатка в количестве " +  СовсемНеХватило +" шт.");
//	//					КонецЕсли;
//	//				КонецЕсли;
//	//				
//	//            ТаблицаДляЗагрузкиВЗК.Свернуть("Контрагент,Номенклатура,СкладID	,Склад", "Количество");				
//	//				
//	//			КонецЦикла;							
//	//			
//	//			
//	//			Если ТаблицаДляЗагрузкиВЗК.Количество()>0 Тогда 
//	//				НовыйЗаказ = Документы.ЗаказКлиента.СоздатьДокумент(); 
//	//				НовыйЗаказ.Контрагент = Клиент;   // Партнер или же контрагент 
//	//				//??
//	//				//НовыйЗаказ.Партнер = Клиент.Партнер;
//	//				//
//	//				//НовыйЗаказ.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("Партнер", Клиент);
//	//				// Договор + соглашение
//	//				НовыйЗаказ.Статус = Перечисления.СтатусыЗаказовКлиентов.КОбеспечению;
//	//				НовыйЗаказ.СКлад = Склад; 
//	//				НовыйЗаказ.Дата = ТекущаяДата();
//	//				НовыйЗаказ.Организация = Справочники.Организации.НайтиПоНаименованию("ООО "Горторгснаб"");
//	//				НовыйЗаказ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
//	//				// Дата отгрузки
//	//				// Налогообложение!!!!!
//	//				// Валюта
//	//				// Цена включает ндс??
//	//				
//	//				// остальные рекв?? 
//	//				
//	//				Для Каждого Стр из ТаблицаДляЗагрузкиВЗК  Цикл 
//	//					НовСтр = НовыйЗаказ.Товары.Добавить(); 
//	//					НовСтр.Номенклатура = Стр.Номенклатура;
//	//					Новстр.Количество =  Стр.Количество;   
//	//					// Количество упаковок = колво
//	//					// Цена
//	//					// Сумма
//	//					// Ставка ндс    ? из номен или по другому?
//	//					// перерасчет ставок ндс
//	//					Новстр.Склад = Стр.склад;
//	//					НовСтр.ВариантОбеспечения =  Перечисления.ВариантыОбеспечения.СоСклада;
//	//					
//	//					// остальные рекв?? 
//	//				КонецЦикла; 
//	//				НовыйЗаказ.ОбменДанными.Загрузка = Истина; 
//	//				// Проведение ?
//	//				НовыйЗаказ.Записать();
//	//			КонецЕсли;
//	//		КонецЦикла;
//	//		
//	//	КонецЦикла;
//	//	
//	//	
//	//	
//	//	
//	//	
//	//	
//	//	
//	//	
//	//	
//	//	
//	//	
//	//	ТабДок = Новый ТабличныйДокумент;
//	//	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
//	//	ДД = Новый ДвоичныеДанные(ИмяФайла);
//	//	
//	//	
//	//	//		КонецЦикла;
//	//	//		
//	//	//		СтруктураОст.Вставить("count" ,МассивСклады);
//	//	//		ОстаткиТовара.Добавить(СтруктураОст);
//	//	//	КонецЦикла;  
//	//	//	СтруктураОтвета.Вставить("Номенклатура", ОстаткиТовара);
//	//	//	МассивОтвета.Добавить(СтруктураОтвета)/// 
//	//	//КонецЦикла;
//	//	//Исключение
//	//	//ОшибкаОбработки = Истина;
//	//	//КонецПопытки;
//	//	//ЗаписьJSON = Новый ЗаписьJSON;
//	//	//ЗаписьJSON.УстановитьСтроку();
//	//	//Ответ.Вставить("ИдентификаторКонтрагента",МассивОтвета );
//	//	//Ответ.Вставить("Errors",МассивОшибок );
//	//	//Если ОшибкаОбработки Тогда  
//	//	//ЗаписатьJSON(ЗаписьJSON, Ответ);
//	//	//СтрокаДляОтвета = ЗаписьJSON.Закрыть();
//	//	//ОтветОшибка.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8"); ///???
//	//	//ОтветОшибка.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
//	//	//Возврат ОтветОшибка;
//	//	//Иначе
//	//	//Если ОшибкаНоменклатуры Тогда
//	//	//	ЗаписатьJSON(ЗаписьJSON, Ответ);
//	//	//	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
//	//	//	ОтветОшибкаНом.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8"); ///???
//	//	//	ОтветОшибкаНом.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
//	//	//	Возврат ОтветОшибкаНом;  
//	//	//Иначе	
//	//	//	ЗаписатьJSON(ЗаписьJSON, Ответ);
//	//	//	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
//	//	//	ОтветНомен.Заголовки.Вставить("Content-type", "application/JSON;  charset=utf-8"); ///???
//	//	//	ОтветНомен.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
//	//	//	Возврат ОтветНомен;  
//	//	//КонецЕсли;
//	//	//КонецЕсли;
//	//	
//	//	
//	//	
//	//	//Ответ = Новый HTTPСервисОтвет(200);
//	//	//Возврат Ответ;
//	КонецФункции
//	
//
